# !/usr/bin/env python
# -*- coding: utf-8 -*-
# date: 2020/06/06
# author: Suqier
# email: suqier5637@foxmail.com
# 在这里尝试着翻译并自己练习黄海广博士的numpy-100项目
# 项目原地址：https://github.com/rougier/numpy-100

# 第十二题：创建一个 3 * 3 * 3 的（三维）数组，其中元素的值使用随机数进行填充

import numpy as np

Z = np.random.random((3, 3, 3))     # np.random.random 生成的是浮点数
print(Z)

# 输出内容：
# [[[0.81133802 0.88242429 0.92751268]
#   [0.03543462 0.02160899 0.19438541]
#   [0.70004057 0.85063779 0.30079342]]
#
#  [[0.28626325 0.27521712 0.27759208]
#   [0.88091716 0.58130149 0.32578753]
#   [0.35711404 0.19001524 0.21138244]]
#
#  [[0.34659509 0.0790582  0.57374181]
#   [0.75844353 0.97007919 0.8942953 ]
#   [0.84921931 0.20581702 0.33792976]]]


