# !/usr/bin/env python
# -*- coding: utf-8 -*-
# date: 2020/06/06
# author: Suqier
# email: suqier5637@foxmail.com
# 在这里尝试着翻译并自己练习黄海广博士的numpy-100项目
# 项目原地址：https://github.com/rougier/numpy-100

# 第十四题：创建一个长度为 30 的随机向量；并找出平均值

import numpy as np

Z = np.random.random(30)
print(Z)

m = Z.mean()
print("Z's mean = {}".format(m))

# 输出内容：
# [0.5384556  0.65318582 0.82477831 0.46437444 0.96203613 0.47629959
#  0.65478737 0.6348106  0.76834284 0.14088924 0.84129848 0.30400281
#  0.66828966 0.21841397 0.86250164 0.74588346 0.70840973 0.88615067
#  0.83506398 0.09331951 0.10073031 0.8606392  0.16055303 0.0132611
#  0.62287857 0.63283309 0.97578397 0.57540795 0.25828656 0.49222668]
# Z's mean = 0.5657964774178086
