# !/usr/bin/env python
# -*- coding: utf-8 -*-
# date: 2020/06/06
# author: Suqier
# email: suqier5637@foxmail.com
# 在这里尝试着翻译并自己练习黄海广博士的numpy-100项目
# 项目原地址：https://github.com/rougier/numpy-100

# 第四十题：创建一个长度为 10 的随机向量并排序

import numpy as np

Z = np.random.random(10)
print(Z)

print("---------")
Z.sort()
print(Z)

# 输出内容：
# [0.75531794 0.3496498  0.65712978 0.39326076 0.23894618 0.97023477
#  0.92386807 0.96688456 0.95771303 0.61994551]
# ---------
# [0.23894618 0.3496498  0.39326076 0.61994551 0.65712978 0.75531794
#  0.92386807 0.95771303 0.96688456 0.97023477]
